Revit 2024 API
RebarContainer.ClearItems Method
 Clears all the Items stored in this Rebar Container element.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public void ClearItems()
Visual Basic
Public Sub ClearItems
Visual C++
public:
void ClearItems()
See Also
RebarContainer Class
Autodesk.Revit.DB.Structure Namespace